#include <iostream> //стандартная бибилиотека ввода-вывода
using namespace std; //простанство имен std

int main() //главная функция программы, точка ее старта
{
	setlocale(0, "ru"); //локализация кирилицы для кода
	/*2. Дан двумерный массив размерностью 5х5, заполненный случайными числами из диапазона от -5 до 5.
	Определить количество положительных и нулевых элементов.*/
	const int size = 5; //оглашение константы количнства строк и столбцов в двумерном массиве
	int arr[size][size], plus = 0, zero = 0;
	//оглашение двумерного массива 5х5, переменных его положительных и нулевых элементов
	srand(time(0));
	/*функция, благодаря которой каждый раз при активации программы рандомно будут генерироваться
	РАЗНЫЕ числа*/
	for (int i = 0; i < size; i++) //цикл для работы со строками
	{
		for (int j = 0; j < size; j++) //цикл для работы со столбцами
		{
			arr[i][j] = rand() % 11 - 5; //генерация чисел в диапазоне от -5 до 5
			cout << arr[i][j] << "\t"; //вывод элементов строки через табуляцию
			if (arr[i][j] > 0) //условие положительного элемента массива
			{
				plus++; //увеличение количества положительных элементов массива при истинности условия
			}
			else if (arr[i][j] == 0) //условие нулевого элемента массива
			{
				zero++; //увеличение количества нулевых элементов массива при истинности условия
			}
		}
		cout << endl << endl; //переход на следующую строку "матрицы"
	}
	cout << "Количество положительных элементов массива = " << plus << ", а нулевых = " << zero;
	//вывод количества положительных и нулевых элементов в двумерном массиве

	cout << "\n------------------------------------------------------------\n";

	/*3. Дан двумерный массив размерностью 5х5, заполненный случайными числами из диапазона от 0 до 20.
	Определить сумму по каждой строке массива.*/
	int ARR[size][size], sum[size], s = 0, l = 0;
	/*оглашение двумерного массива размерностью 5х5, массива сум элементов по строкам, переменных суммы
	элементов строки и индекса массива сум*/
	for (int i = 0; i < size; i++) //цикл для работы со строками
	{
		for (int j = 0; j < size; j++) //цикл для работы со столбцами
		{
			ARR[i][j] = rand() % 21; //генерация чисел в диапазоне от 0 до 20
			cout << ARR[i][j] << "\t"; //вывод элементов строки через табуляцию
			s += ARR[i][j]; //добавление элемента строки в ее сумму
		}
		sum[l] = s; //вкладывание значения суммы строки в массив
		l++; //увеличение индекса массива сум элементов по строкам
		s = 0; //обнуление суммы строки для формировнаия отдельной суммы другой строки
		cout << endl << endl; //переход на следующую строку "матрицы"
	}
	cout << "Сумма по каждой строке массива: \n";
	for (int i = 0; i < size; i++) //цикл вывода сум элементов каждой строки
	{
		cout << sum[i] << "\t"; //вывод суммы элементов строки
	}

	cout << "\n------------------------------------------------------------\n";

	/*4. Дан двумерный массив размерностью 5х5, заполненный случайными числами из диапазона от 0 до 20.
	Определить сумму по каждому столбцу массива.*/
	int mass[size][size], SUM[size] = { 0 };
	//оглашение двумерного массива, одномерного массива сум элементов одного столбца
	for (int i = 0; i < size; i++) //цикл для работы со строками
	{
		for (int j = 0; j < size; j++) //цикл для работы со столбцами
		{
			mass[i][j] = rand() % 21; //генерация чисел в диапазоне от 0 до 20
			cout << mass[i][j] << "\t"; //вывод элементов строки через табуляцию
			SUM[j] += mass[i][j];
			/*сначала ввод элементов строки под все индексы, а затем прибавление к ним элементов
			следуюших строк с теми же индексами столбца*/
		}
		cout << endl << endl; //переход на следующую строку "матрицы"
	}
	cout << "Суммы элементов по каждому столбцу: \n";
	for (int i = 0; i < size; i++) //цикл вывода сум элементов каждого столбца
	{
		cout << SUM[i] << "\t"; //вывод суммы элементов стоблца
	}

	cout << "\n------------------------------------------------------------\n";
	cout << "------------------------------------------------------------\n";

	//Задание на подумать (успешно сделано)
	/*5. Дан двумерный массив размерностью 5х5, заполненный случайными числами из диапазона от -10 до 40.
	Определить сумму элементов для тех столбцов, которые не содержат ни одного отрицательного элемента.*/
	int MASS[size][size], summa[size] = { 0 };
	/*оглашение двумерного массива и массива сум элемента столбцов, которые не содержат ни одного
	отрицательного элемента*/
	for (int i = 0; i < size; i++) //цикл для работы со строками
	{
		for (int j = 0; j < size; j++) //цикл для работы со столбцами
		{
			MASS[i][j] = rand() % 51 - 10; //генерация чисел в диапазоне от -10 до 40
			cout << MASS[i][j] << "\t"; //вывод элементов строки через табуляцию
		}
		cout << endl << endl; //переход на следующую строку "матрицы"
	}
	bool no_negative[size]; //логический массив наличия отрицательных элементов в с
	for (int i = 0; i < size; i++) //цикл для работы со столбцами
	{
		for (int j = 0; j < size; j++) //цикл для работы со строками
		{
			no_negative[i] = true;
			//изначально мы считаем, что отрицательных элементов в столбце массива нет
			if (MASS[j][i] < 0) //если элемент отрицательный
				/*в отличии от обычной работой программы с массивами, были поменяны местами индексы,
				чтоб проверять сначала элементы одного столбца (переходить из элемента одной строки сразу к
				другой), а затем приступать к следующему  и снова проверять его элементы*/
			{
				no_negative[i] = false; //фиксируем наличие отрицательных элементов в столбце массива
				break; //и прерываем цикл проверки элементов столбца на отрицательность
			}
			else //если элемент не отрицательный
			{
				summa[i] += MASS[j][i]; //добавлять его в сумму элементов своего столбца
			}
		}
	}
	for (int i = 0; i < size; i++)
		//цикл вывода суммы элементов столбца или сообщения о наличии в нем отрицательных элементов
	{
		if (no_negative[i]) //если отрицательных элементов нет в столбце массива
		{
			cout << "Сумма элементов " << i + 1 << " столбца = " << summa[i] << "\n";
			//вывести сумму элементов столбца
		}
		else //если отрицательные элементы есть в столбце массива
		{
			cout << "В " << i + 1 << "-м столбце есть отрицательные элементы. " << "\n";
			//вывести о наличии в столбце массива отрицательных чисел
		}
	}
}